{
  "nav": {
    "home": "Home",
    "about": "About",
    "career": "Career",
    "projects": "Projects",
    "contact": "Contact"
  },
  "languages": {
    "pt": "Português",
    "en": "English",
    "zh": "中文"
  },
  "title": "Dev.Leo",
  "greeting": "Hello, I am <span>Leo</span>",
  "description": "Full Stack Developer (C# / Java) | Web Architecture Specialist | Robotics & Programming Instructor",
  "aboutMe": "About Me",
  "aboutText": "Hello! I am Leo, 22 years old, and a student of Physics and Computer Science. I work as a Robotics and Programming teacher, working with diverse audiences — from children taking their first steps in technology to adults seeking to deepen their knowledge in data analysis and deep learning. My main programming languages are Java and C#, but I also teach C++, GML, GDScript, JavaScript, and Python, as well as work with libraries and frameworks like Pandas and React.js. I am passionate about Physics and Programming, and my ultimate goal is to unite these two fields to develop innovative solutions in the future. I enjoy making knowledge accessible, sparking curiosity and creativity in every project and class I undertake.",
  "careerTitle": "Career",
  "career1Title": "Front-End Intern | Angular & Ionic",
  "career1Company": "TT & T Solutions — Unpaid Internship<br>Duration: 2 months",
  "career1Description": "Internship focused on front-end development using Angular and Ionic. Contributed to UI components and interface prototyping, with focus on accessibility and responsive design.",
  "career2Title": "CLT General Assistant",
  "career2Company": "Seu Lugar Telecom<br>2023 – 2024",
  "career2Description": "Performed administrative and operational tasks, supporting the team and customer service.",
  "career2bTitle": "PJ Junior Fullstack Developer",
  "career2bCompany": "Seu Lugar Telecom<br>2023 – 2024",
  "career2bDescription": "Developed web and mobile applications, including client area and landing pages for the company. Used C#, Angular, Ionic, and REST APIs to deliver modern and responsive solutions. Duration: 1 year.",
  "career3Title": "Robotics & Programming Instructor",
  "career3Company": "Ctrl+Play Limeira<br>2024 – Present",
  "career3Description": "Responsible for teaching logic, game development (GameMaker, Godot, Unity), web development (React.js, JavaScript, Python), and fundamentals of data analysis and AI (Pandas, PyTorch). Adapted content for different age groups, promoting computational thinking and technical growth.",
  "projectsTitle": "Projects",
  "project1Title": "Minima Studio (Landing Page)",
  "project1Description": "Minima Studio is a personal landing page for a fictional design company. Focused on branding, digital interfaces, and a modern experience, with smooth navigation, responsive design, and minimalist elements. Ideal for portfolios or business presentations.",
  "project2Title": "DevLoop (Mentoring Platform)",
  "project2Description": "DevLoop is a complete web platform for developer mentoring. Allows mentor/mentee registration, session scheduling, availability management, video calls (WebRTC), integrated chat, reviews, and video uploads. Backend in Java Spring Boot and frontend in React, focused on communication and professional development.",
  "project1Link": "View projects",
  "project3Title": "Luna (Financial Management)",
  "project3Description": "Luna is a web application for money management, built with TypeScript and Vite. Enables intuitive and responsive control of expenses, income, and balance. Perfect for personal or business financial organization, with a focus on usability and modern design.",
  "project4Title": "Modern Task List",
  "project4Description": "Web application developed as a technical challenge, focused on accessibility, usability, and modern visuals. Allows adding, editing, deleting, and filtering tasks by status and tags, setting due dates, switching between light/dark themes, and adjusting font size. Fully responsive, with local persistence and keyboard navigation.",
  "project5Title": "Orbitr (Project Kanban)",
  "project5Description": "Orbitr is a web Kanban application for visual task management and team collaboration. Backend in Java Spring Boot and frontend in Angular, with features like boards, tasks with comments, attachments, labels, email notifications, JWT authentication, and PostgreSQL integration. Ideal for organizing projects, assigning tasks, and tracking progress in real time.",
  "deploy": "Deploy",
  "github": "GitHub",
  "project2Link": "Learn more",
  "cvDownloadPt": "CV (PT)",
  "cvDownloadEn": "CV (EN)",
  "contactTitle": "Contact",
  "contactText": "Contact me via email: <a href=\"mailto:leonardo.moreira6854@gmail.com\">leonardo.moreira6854@gmail.com</a>",
  "footerText": "&copy; 2025 Dev.Leo. All rights reserved.",
  "accessibility": {
    "skipToContent": "Skip to content",
    "darkMode": "Switch to dark mode",
    "lightMode": "Switch to light mode",
    "menuToggle": "Open menu"
  }
}
