{
  "nav": {
    "home": "Home",
    "about": "About",
    "career": "Career",
    "projects": "Projects",
    "contact": "Contact"
  },
  "languages": {
    "pt": "Português",
    "en": "English",
    "zh": "中文"
  },
  "title": "Dev.Leo",
  "greeting": "Hello, I am <span>Leo</span>",
  "description": "Full Stack Developer (C# / Java) | Web Architecture Specialist | Robotics & Programming Instructor",
  "aboutMe": "About Me",
  "aboutText": "Hello! I am Leo, 22 years old, and a student of Physics and Computer Science. I work as a Robotics and Programming teacher, working with diverse audiences — from children taking their first steps in technology to adults seeking to deepen their knowledge in data analysis and deep learning. My main programming languages are Java and C#, but I also teach C++, GML, GDScript, JavaScript, and Python, as well as work with libraries and frameworks like Pandas and React.js. I am passionate about Physics and Programming, and my ultimate goal is to unite these two fields to develop innovative solutions in the future. I enjoy making knowledge accessible, sparking curiosity and creativity in every project and class I undertake.",
  "careerTitle": "Career",
  "career1Title": "Front-End Intern | Angular & Ionic",
  "career1Company": "TT & T Solutions — Unpaid Internship<br>Duration: 2 months",
  "career1Description": "Contributed to a recruitment platform, building performant UI components in Angular 5 + Ionic and supporting interface prototyping in Figma. Focused on accessibility, responsiveness and reusable component structure while reinforcing agile collaboration and version control practices.",
  "career2Title": "Multidisciplinary Technical Assistant | Java Backend",
  "career2Company": "Seu Lugar Telecom<br>2023 – 2024",
  "career2Description": "End-to-end contributions in an early-stage operation: server setup, API integrations and internal tool development in Java. Structured lean, stable flows emphasizing scalability and reliability, gaining holistic visibility of infrastructure and product lifecycle in a startup context.",
  "career3Title": "Robotics & Programming Instructor | Tech Education",
  "career3Company": "Ctrl+Play Limeira<br>2024 – Present",
  "career3Description": "Design and deliver learning paths in logic, game development (GameMaker, Godot, Unity), web development (React.js, JavaScript, Python) and fundamentals of data analysis & AI (Pandas, PyTorch). Adapt curricula by age/level, reinforcing computational thinking and measurable technical progression.",
  "projectsTitle": "Projects",
  "project1Title": "Project 1",
  "project1Description": "Minima Studio is a landing page for a fictional visual design studio, focused on branding and digital interfaces. The platform offers a modern and sophisticated experience, with smooth navigation, responsive design, and elements that highlight the brand's minimalist identity.",
  "deploy": "Deploy",
  "github": "GitHub",
  "project2Title": "Project 2",
  "project2Description": "DevLoop is a web mentoring platform for developers, connecting mentees and tech mentors in a modern and intuitive environment. It allows session scheduling, availability management, reviews, chat, and progress tracking, facilitating professional growth and knowledge exchange in software development.",
  "project2Link": "Learn more",
  "cvDownloadPt": "CV (PT)",
  "cvDownloadEn": "CV (EN)",
  "contactTitle": "Contact",
  "contactText": "Contact me via email: <a href=\"mailto:leonardo.moreira6854@gmail.com\">leonardo.moreira6854@gmail.com</a>",
  "footerText": "&copy; 2025 Dev.Leo. All rights reserved.",
  "accessibility": {
    "skipToContent": "Skip to content",
    "darkMode": "Switch to dark mode",
    "lightMode": "Switch to light mode",
    "menuToggle": "Open menu"
  }
}
