{
  "nav": {
    "home": "Início",
    "about": "Sobre",
    "career": "Carreira",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "languages": {
    "pt": "Português",
    "en": "English",
    "zh": "中文"
  },
  "title": "Dev.Leo",
  "greeting": "Olá, eu sou o <span>Leo</span>",
  "description": "Desenvolvedor Full Stack (C# / Java) | Especialista em Arquitetura Web | Professor de Robótica & Programação",
  "aboutMe": "Sobre Mim",
  "aboutText": "Olá! Sou o Leo, tenho 22 anos e sou estudante de Física e Ciência da Computação. Atuo como professor de Robótica e Programação, trabalhando com públicos diversos — desde crianças que estão dando os primeiros passos na tecnologia até adultos que buscam se aprofundar em análise de dados e deep learning. Minhas principais linguagens de atuação são Java e C#, mas também leciono C++, GML, GDScript, JavaScript e Python, além de trabalhar com bibliotecas e frameworks como Pandas e React.js. Sou apaixonado por Física e Programação, e meu grande objetivo é unir essas duas áreas para desenvolver soluções inovadoras no futuro. Gosto de tornar o conhecimento acessível, despertando a curiosidade e a criatividade em cada projeto e aula que realizo.",
  "careerTitle": "Carreira",
  "career1Title": "Estagiário de Front-End | Angular & Ionic",
  "career1Company": "TT & T Soluções — Estágio não remunerado<br>Duração: 2 meses",
  "career1Description": "Colaborei no desenvolvimento de uma plataforma de recrutamento, construindo interfaces performáticas com Angular 5 e Ionic e apoiando a prototipagem no Figma. Foquei em acessibilidade, responsividade e organização de componentes reutilizáveis, reforçando boas práticas de versionamento e colaboração ágil.",
  "career2Title": "Auxiliar Técnico Multidisciplinar | Backend Java",
  "career2Company": "Seu Lugar Telecom<br>2023 – 2024",
  "career2Description": "Em fase inicial da operação, atuei de ponta a ponta: configuração de servidores, integrações de APIs e desenvolvimento de aplicações internas usando Java. Estruturei fluxos estáveis e enxutos focados em escalabilidade e confiabilidade, adquirindo visão ampla de infraestrutura e produto em ambiente de startup.",
  "career3Title": "Instrutor de Robótica & Programação | Formação Tech",
  "career3Company": "Ctrl+Play Limeira<br>2024 – Atual",
  "career3Description": "Responsável por trilhas formativas em lógica, desenvolvimento de jogos (GameMaker, Godot, Unity), desenvolvimento web (React.js, JavaScript, Python) e fundamentos de análise de dados e IA (Pandas, PyTorch). Estruturo conteúdos adaptativos por faixa etária, promovendo base sólida de pensamento computacional e evolução contínua de performance técnica dos alunos.",
  "projectsTitle": "Projetos",
  "project1Title": "Projeto 1",
  "project1Description": "Minima Studio é uma landing page para um estúdio fictício de design visual, focada em branding e interfaces digitais. A plataforma oferece uma experiência moderna e sofisticada, com navegação fluida, design responsivo e elementos que destacam a identidade minimalista da marca.",
  "deploy": "Deploy",
  "github": "GitHub",
  "project2Title": "Projeto 2",
  "project2Description": "DevLoop é uma plataforma web de mentoria para desenvolvedores, conectando mentees e mentores de tecnologia em um ambiente moderno e intuitivo. Permite agendamento de sessões, gerenciamento de disponibilidade, avaliações, chat e acompanhamento de progresso, facilitando o crescimento profissional e a troca de conhecimento na área de desenvolvimento de software.",
  "project2Link": "Ver mais",
  "cvDownloadPt": "CV (PT)",
  "cvDownloadEn": "CV (EN)",
  "contactTitle": "Contato",
  "contactText": "Entre em contato pelo e-mail: <a href=\"mailto:leonardo.moreira6854@gmail.com\">leonardo.moreira6854@gmail.com</a>",
  "footerText": "&copy; 2025 Dev.Leo. Todos os direitos reservados.",
  "accessibility": {
    "skipToContent": "Pular para o conteúdo",
    "darkMode": "Alternar para modo escuro",
    "lightMode": "Alternar para modo claro",
    "menuToggle": "Abrir menu"
  }
}
