{
  "nav": {
    "home": "Início",
    "about": "Sobre",
    "career": "Carreira",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "languages": {
    "pt": "Português",
    "en": "English",
    "zh": "中文"
  },
  "title": "Dev.Leo",
  "greeting": "Olá, eu sou o <span>Leo</span>",
  "description": "Desenvolvedor Full Stack (C# / Java) | Especialista em Arquitetura Web | Professor de Robótica & Programação",
  "aboutMe": "Sobre Mim",
  "aboutText": "Olá! Sou o Leo, tenho 22 anos e sou estudante de Física e Ciência da Computação. Atuo como professor de Robótica e Programação, trabalhando com públicos diversos — desde crianças que estão dando os primeiros passos na tecnologia até adultos que buscam se aprofundar em análise de dados e deep learning. Minhas principais linguagens de atuação são Java e C#, mas também leciono C++, GML, GDScript, JavaScript e Python, além de trabalhar com bibliotecas e frameworks como Pandas e React.js. Sou apaixonado por Física e Programação, e meu grande objetivo é unir essas duas áreas para desenvolver soluções inovadoras no futuro. Gosto de tornar o conhecimento acessível, despertando a curiosidade e a criatividade em cada projeto e aula que realizo.",
  "careerTitle": "Carreira",
  "career1Title": "Estagiário de Front-End | Angular & Ionic",
  "career1Company": "TT & T Soluções — Estágio não remunerado<br>Duração: 2 meses",
  "career1Description": "Colaborei no desenvolvimento de uma plataforma de recrutamento, construindo interfaces performáticas com Angular 5 e Ionic e apoiando a prototipagem no Figma. Foquei em acessibilidade, responsividade e organização de componentes reutilizáveis, reforçando boas práticas de versionamento e colaboração ágil.",
  "career2Title": "Auxiliar Geral",
  "career2Company": "Seu Lugar Telecom<br>2023 – 2024",
  "career2Description": "Atuação em funções administrativas e operacionais, suporte ao time e atendimento ao cliente.",
  "career2bTitle": "PJ Desenvolvedor Fullstack Junior",
  "career2bCompany": "Seu Lugar Telecom<br>2023 – 2024",
  "career2bDescription": "Desenvolvimento de aplicações web e mobile, incluindo área do cliente e landing pages para a empresa. Utilização de C#, Angular, Ionic e APIs REST para entregar soluções modernas e responsivas. Duração: 1 ano.",
  "career3Title": "Instrutor de Robótica & Programação | Formação Tech",
  "career3Company": "Ctrl+Play Limeira<br>2024 – Atual",
  "career3Description": "Responsável por trilhas formativas em lógica, desenvolvimento de jogos (GameMaker, Godot, Unity), desenvolvimento web (React.js, JavaScript, Python) e fundamentos de análise de dados e IA (Pandas, PyTorch). Estruturo conteúdos adaptativos por faixa etária, promovendo base sólida de pensamento computacional e evolução contínua de performance técnica dos alunos.",
  "projectsTitle": "Projetos",
  "project1Title": "Minima Studio (Landing Page)",
  "project1Description": "Minima Studio é uma landing page pessoal criada para uma empresa fictícia de design visual. O projeto foca em branding, interfaces digitais e experiência moderna, com navegação fluida, design responsivo e elementos minimalistas. Ideal para portfólios ou apresentações de negócios criativos.",
  "github": "GitHub",
  "project2Title": "DevLoop (Plataforma de Mentoria)",
  "project2Description": "DevLoop é uma plataforma web completa para mentoria de desenvolvedores. Permite cadastro de mentores e mentorados, agendamento de sessões, gerenciamento de disponibilidade, chamadas de vídeo (WebRTC), chat integrado, avaliações e upload de vídeos. Backend em Java Spring Boot e frontend em React, com foco em comunicação e experiência responsiva.",
  "project2Link": "Ver mais",
    "project3Title": "Luna (Gestão Financeira)",
    "project3Description": "Luna é uma aplicação web para gerenciamento de dinheiro, criada com TypeScript e Vite. Permite controlar despesas, receitas e visualizar o saldo de forma intuitiva e responsiva. Ideal para quem busca organização financeira pessoal ou empresarial, com foco em usabilidade e design moderno.",
    "project4Title": "Lista de Tarefas Moderna",
    "project4Description": "Aplicação web desenvolvida como desafio técnico, focada em acessibilidade, usabilidade e visual moderno. Permite adicionar, editar, excluir e filtrar tarefas por status e tags, definir data de vencimento, alternar entre temas claro/escuro e ajustar o tamanho da fonte. Totalmente responsiva, com persistência local e navegação por teclado.",
    "project5Title": "Orbitr (Kanban de Projetos)",
    "project5Description": "Orbitr é uma aplicação web de Kanban para gestão visual de tarefas e colaboração em equipes. Possui backend em Java Spring Boot e frontend em Angular, com recursos como quadros, tarefas com comentários, anexos, etiquetas, notificações por e-mail, autenticação JWT e integração com PostgreSQL. Ideal para organizar projetos, atribuir tarefas e acompanhar o progresso.",
  "cvDownloadPt": "CV (PT)",
  "cvDownloadEn": "CV (EN)",
  "contactTitle": "Contato",
  "contactText": "Entre em contato pelo e-mail: <a href=\"mailto:leonardo.moreira6854@gmail.com\">leonardo.moreira6854@gmail.com</a>",
  "footerText": "&copy; 2025 Dev.Leo. Todos os direitos reservados.",
  "accessibility": {
    "skipToContent": "Pular para o conteúdo",
    "darkMode": "Alternar para modo escuro",
    "lightMode": "Alternar para modo claro",
    "menuToggle": "Abrir menu"
  }
}
