const zh = {
  nav: {
    home: "首页",
    about: "关于",
    projects: "项目"
  },
  home: {
    title: "欢迎来到DevLeo",
    description: "DevLeo是一个致力于以清晰、富有表现力和教学性的方式分享项目、想法和研究的个人倡议。虽然其结构类似于数字杂志，但其目的超越了简单的出版，作为持续记录、反思和实验的空间。该平台汇集了软件开发项目、技术研究和以研究为导向的工作，不仅展示最终结果，还展示每个倡议所涉及的过程、挑战和决策。通过将实际开发与分析和研究方法相结合，DevLeo旨在弥合实施与理解之间的差距。通过文章、项目展示和技术笔记，该网站旨在促进知识共享，鼓励批判性思维，并提供对技术和科学不同领域持续学习和探索的透明视图。",
    btn: "查看项目"
  },
  carousel: {
    programming: "编程",
    science: "科学",
    references: "参考文献"
  },
  about: {
    title: "关于Leo",
    description: "你好，我是Leo。我是物理和计算机科学的大学生，对理论基础和实际应用都有浓厚的兴趣。在过去的两年里，我一直担任讲师，教授机器人和编程，同时为中小型企业开发软件解决方案。我对学习和持续改进充满热情。目前，我正在学习普通话，目标是获得HSK（汉语水平考试）认证，进一步拓展我的学术和文化视野。"
  },
  projects: {
    title: "项目"
  },
  footer: {
    tagline: "热衷于创建有影响力的数字解决方案的全栈开发者。",
    navigation: "导航",
    connect: "联系",
    copyright: "2025 Leonardo Moreira。保留所有权利。",
    location: "巴西圣保罗"
  }
};
